app/controllers/messages_controller.rb

INSERT INTO "messages" ("content", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["content", "hello world"], ["created_at", Mon, 15 Sep 2014 11:11:15 UTC +00:00], ["name", "sai"], ["updated_at", Mon, 15 Sep 2014 11:11:15 UTC +00:00]]
---
  def create
    response.headers['Content-Type'] = 'text/javascript'
    attributes = params.require(:message).permit(:name, :content)
    @messages  = Message.create!(attributes)